CSI API ETABS v1
eSlabType Enumeration
 The possible slab types.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eSlabType
Public Enumeration eSlabType
Dim instance As eSlabType
public enum class eSlabType
type eSlabType
Members
Member name | Value | Description
Slab | 0
Drop | 1
Stiff_DO_NOT_USE | 2
Ribbed | 3
Waffle | 4
Mat | 5
Footing | 6
Remarks
See Also
Reference
ETABSv1 Namespace